Foundation/extensions/global/template/webservice/fedex/createPickupRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v5="http://fedex.com/ws/pickup/v5">
	<soapenv:Header/>
	<soapenv:Body>
		<v5:CreatePickupRequest>
			<v5:WebAuthenticationDetail>
				<v5:UserCredential>
				<v5:Key></v5:Key>
				<v5:Password></v5:Password>
				</v5:UserCredential>
			</v5:WebAuthenticationDetail>
			<v5:ClientDetail>
				<v5:AccountNumber></v5:AccountNumber>
				<v5:MeterNumber></v5:MeterNumber>
			</v5:ClientDetail>
			<v5:TransactionDetail>
				<v5:CustomerTransactionId></v5:CustomerTransactionId>
			</v5:TransactionDetail>
			<v5:Version>
				<v5:ServiceId>disp</v5:ServiceId>
				<v5:Major>5</v5:Major>
				<v5:Intermediate>0</v5:Intermediate>
				<v5:Minor>0</v5:Minor>
			</v5:Version>
			<v5:OriginDetail>
				<v5:UseAccountAddress>false</v5:UseAccountAddress>
				<v5:PickupLocation>
					<v5:Contact>
						<v5:CompanyName></v5:CompanyName>
					</v5:Contact>
					<v5:Address>
						<v5:StreetLines></v5:StreetLines>
						<v5:City></v5:City>
						<v5:StateOrProvinceCode></v5:StateOrProvinceCode>
						<v5:PostalCode></v5:PostalCode>
						<v5:CountryCode></v5:CountryCode>
						<v5:Residential>false</v5:Residential>
					</v5:Address>
				</v5:PickupLocation>
				<v5:ReadyTimestamp></v5:ReadyTimestamp>
				<v5:CompanyCloseTime></v5:CompanyCloseTime>
			</v5:OriginDetail>
			<v5:PackageCount></v5:PackageCount>
			<v5:TotalWeight>
				<v5:Units></v5:Units>
				<v5:Value></v5:Value>
			</v5:TotalWeight>
			<v5:CarrierCode></v5:CarrierCode>
		</v5:CreatePickupRequest>
	</soapenv:Body>
</soapenv:Envelope>